sdaiCreateNestedAggrByItr(Sdai_ItrId*)
\details
Creates an aggregate instance replacing the current member of the
aggregate instance referenced by the specified iterator
\param current [in]  iterator referencing the current member of the aggregate.
\returns Returns identifier of the newly created aggregate instance.